Autodesk.Navisworks.Api.ViewpointImageFit
Describes how to adapt the camera view so that its aspect ratio matches that of the display window.

Autodesk.Navisworks.Api.ViewpointImageFit.Mask
The frustum is used as is within the largest subset of the window that has the correct aspect ratio. The rest of the window is masked out (e.g. black bars).

Autodesk.Navisworks.Api.ViewpointImageFit.Fill
The frustum extents are enlarged so that all of the original image is visible.

Autodesk.Navisworks.Api.ViewpointImageFit.Vertical
Only HorizontalExtent is modified so that vertical extent is preserved.

Autodesk.Navisworks.Api.ViewpointImageFit.Horizontal
Only VerticalExtent is modified so that horizontal extent is preserved.

Autodesk.Navisworks.Api.ViewpointImageFit.Overscan
The frustum extents are reduced so that a subset of the original image is visible.